the
of
given
return
a
and
is
in
an
to
are
that
you
if
array
integer
number
with
be
where
each
for
all
can
it
from
two
or
any
n
there
one
at
by
such
not
string
as
=
have
1
integers
on
length
0
following
no
-
same
has
will
this
+
may
minimum
x
maximum
after
only
i
ith
example,
sum
value
answer
find
than
nums
some
0-indexed
which
equal
k
between
note
order.
elements
should
its
must
binary
every
then
possible
true
<=
first
we
also
more
s
positive
n,
into
characters
so
2
represents
exactly
<
order
list
make
1.
strings
element
m
left
2d
most
both
contains
least
your
array.
other
int
they
==
size
tree
index
0.
values
different
n.
numbers
node
sequence
their
representing
nodes
k.
when
valid
1,
choose
multiple
right
time
nums.
row
empty
count
write
result
j
does
matrix
sorted
smallest
nums,
do
root
either
another
character
represented
column
consists
3
(i.e.,
false
arrays
it.
consisting
query
indices
three
cannot
using
-1.
want
adjacent
k,
implement
otherwise.
distinct
total
within
non-empty
range
returns
type
key
since
without
largest
move
indicates
unique
position
string.
new
modulo
7.
these
letters
less
name
format
starting
next
operations
contiguous
last
path
grid
ii
exists
defined
class:
109
considered
digits
contain
need
but
s,
set
otherwise,
containing
remove
2,
lowercase
note:
nums[i]
start
table
greater
*
initializes
large,
times
before
substring
generated
denotes
s.
|
b
operation
single
pair
original
them
them.
cell
guaranteed
words
primary
table.
remaining
integer.
0,
form
difference
subarray
take
schema
example.
sql
consecutive
word
table:
numbered
false.
get
until
end
object
target
longest
english
tree,
means
words,
called
add
integers.
arr
that:
test
even
letter
use
design
-1
function
second
times.
strictly
edge
initially
once
tree.
reach
game
current
edges
change
pairs
4
score
product
non-negative
allowed
up
subsequence
always
id
labeled
cells
...
moves
group
assume
four
above
>
while
check
leading
needed
deleting
cases
input
1]
was
characters.
[1,
could
starts
amount
void
digit
i,
connected
however,
distance
once.
perform
replace
3,
very
points
point
appear
because
would
value.
operation,
order,
whose
data
y
where:
time.
positions
formed
square
top
changing
grid.
many
answer[i]
who
represent
ascending
increasing
graph
formally,
varchar
ways
elements.
becomes
respectively.
node.
case
[ai,
notice
jth
pick
integers,
used
5
absolute
linked
edges[i]
delete
resulting
(i,
rules:
appears
determine
substrings
takes
>=
target.
follows:
!=
number.
search
list.
final
left,
common
structure
(possibly
right.
smaller
ai
2.
rows
part
undirected
removing
cost
through
x.
steps
subarrays
arr,
previous
letters.
split
num
about
1)
bi]
swap
person
present
corresponding
output
task
how
head
returned
moving
/
been
shortest
algorithm
required
performing
j)
...,
still
queries
ends
place
lexicographically
right,
call
according
string,
price
good
non-decreasing
t
answers
like
(0,
convert
let
consider
on.
separated
i.
maximize
nums1
if:
c
initially,
target,
among
initial
report
zero
day
equals
values.
complete
along
32-bit
divisible
whether
unique.
solution
is,
down
information
odd
alice
nums[j]
permutation
sort
b.
words.
(0-indexed)
arr.
groups
(0-indexed).
space
[xi,
types
too
digits.
1's
people
possible.
height
conditions:
already
5,
+-------------+---------+
arr[i]
(i.e.
reverse
divide
move,
average
decimal
apply
go
kth
conditions
way
otherwise
ordered
prefix
not.
placed
palindrome
step
boolean
equal.
become
highest
made
being
infinite
numbers.
paths
'a'
directly
applying
6
process
define
out
chosen
obtained
inclusive
duplicate
class
matrix.
satisfies
operations.
accepted.
color
[0,
line
insert
representation
0)
exist
array,
occurs
val
occurrence
x,
j,
actual
bob
city
node,
row.
bottom
lower
following:
times:
exists,
length.
list,
leaf
except
during
3.
playing
1).
were
currently
(in
solve
cell.
nums.length
minimize
uppercase
level
construct
wants
exists.
4,
subset
nodes.
path.
turn,
play
special
valid.
1].
never
itself.
board
repeat
derived
days
query.
shown
bitwise
occurrences
n)
those
over
time,
0's
long
entire
date
none)
subsequences
nums2
written
traversal
player
fit
iii
1],
(not
(including
travel
direction
9
10
other.
bits
keys
necessarily
outside
xor
children
child
select
relative
parent
extra
impossible
'b'
b,
y,
same.
pass
step,
concatenation
t,
zeros.
calls
added
create
rearrange
coordinates
(inclusive).
row,
know
calculate
interval
word.
money
build
alphabet
one.
obtain
area
10-5
closest
removed
connecting
first.
bi
letters,
8
num,
grid,
large
character.
index.
partition
strings,
ans
squares
described
system
element.
columns
negative
suppose
said
day.
null.
back
built-in
frequency
flip
bi.
->
node's
arranged
d
stones
needs
code
bottom-right
goal
queries[i]
'a',
zeros
put
greatest
visit
parentheses
subtree
empty.
rules
customer
user
(the
replacing
satisfy
choosing
just
forward
day,
assigned
line.
game,
stone
players
visited
top-left
1),
adding
answers,
object.
side
based
receive
corner
divided
per
water
concatenated
consist
trees
answer,
max
nth
s[i]
adds
space.
ones
he
group.
graph.
third
example
minutes
only.
points.
children.
leftmost
under
please
employee
[starti,
lengths
inside
also,
s1
yi]
rectangle
describes
(1
up,
root.
(a
n]
nums2,
k)
above.
denoting
larger
+---------------+---------+
digits,
digit.
longer
expression
students
results
mentioned
rotate
signed
matrix,
below
width
turn
%
number,
possible,
ans[i]
key.
random
then,
score.
divisor
it,
item
problem
repeated
text
example:
bst
0).
assign
denote
followed
fewer
num.
standing
circular
passed
conditions.
prices
buy
best
function.
rounded
nums[i
subarray.
prime
turns
edges,
ui
continue
several
answer.
coordinate
'1'
located
it's
bit
include
occur
'e',
unit
s2
optimally.
lowest
front
certain
sums
exceed
merge
empty,
exist,
(i
power
sequence.
p
gets
removes
j.
edges.
colors
integer,
c,
times,
student
map
road
xi
employees
keep
subtract
y.
(n
2)
'b',
arrays.
word,
calculated
(0
sentence
numbers,
respectively,
trailing
complexity.
correct
int[]
t.
strings.
names
finish
beginning
dictionary
append
upper
value,
a,
costs
ids
null
7
modify
match
true:
m.
increase
nums2.
6,
middle
see
position.
inclusive.
ending
nodes,
(1-indexed)
4.
first,
reads
palindromic
destination
non-overlapping
rest
filled
location
points[i]
different.
rearranging
[2,
repeating
'o',
lists
pattern
vertical
found
invalid
4-directionally
state
r
building
taken
meaning
[ui,
c.
follow
transform
that,
box
person.
'.'
users
replaced
m,
version
nearest
jump
alternating
increment
weight
specific
direction.
points,
game.
'
encoded
depth
nums1[i]
spaces
spaces.
'i',
5.
maximized.
letter.
words[i]
'0'
runs
functions
run
items
additional
foreign
concatenating
reaches
second,
cells.
fits
might
structure.
walk
making
directed
his
1st
water.
having
}
print
{
name,
index,
(with
if,
even,
3)
element,
val)
permutations
simultaneously
counted
optimally,
assuming
addition
belongs
including
cities
salary
together.
begin
share
cover
asked
operation.
win
7,
going
belong
elements,
zero.
modified
swaps
seats
"abc"
flips
robot
vertically
key,
cell,
plus
values,
inserts
friends
friend
tie,
immediately
characters,
scores
together
network
process.
changed
constructed
below.
intervals
'z'
full
mat
steps:
file
rightmost
leaves
higher
subsets
program
sequences
sequence,
singly
limit
+-------------+------+
constant
arr.length
way:
(2
suffix
stack
onto
iv
matches
our
deleted
pay
vi]
left.
clockwise
path,
arr[i
meets
remains
sign
c)
(r,
wait
base
2n
starti
queries.
horizontally
follows
o(1)
directions
placing
v
true.
probability
randomly
played
shows
around
done
south,
east,
(m
equal,
rooted
inserted
store
stop
queue
similar
0),
room
stream
continuous
as:
land
intersection
products
to.
b)
l
customers
stops
seconds
off
created
division
transactions
achieve
[lefti,
(can
stock
sell
indices.
arr[j]
returned.
connected,
colored
neighbors
bidirectional
double
employee.
plane,
specifically,
(row,
nums[j].
winner
properties:
horizontal
city.
places.
round
latest
event
events
instead
down,
val.
combination
distribute
leave
pairs.
beautiful
wall
matching
rectangular
operations:
decide
additionally,
ab
accepts
letter,
group,
"".
seat
[left,
representation.
square.
moves.
pile
uses
2nd
possibly
due
differ
(of
lexicographical
x-y
company
period
word1
available
earliest
orders
sorting
pointer
had
minimized.
'c',
units
similarly,
boxes
vertices
rotated
what
[a,
100
+--------------+---------+
profit
identical
frequent
sum.
ones.
segment
swapping
piece
she
either:
balanced
non-zero
(if
minutes.
nums[0]
is:
rotation
open
y)
board.
blue
arr[0]
read
diagonal
method
way.
included
arrays,
denoted
can:
initially.
endi]
3]
maximal
,
rule
input.
minute
user_id
stored
block
house
update
capacity
//
grid[i][j]
five
odd,
top-right
covered
bool
duplicates
generate
|x|
nodes'
product.
0th
name.
nums[k]
length,
graph,
heights
north,
reorder
removed.
parallel
rank
indicating
backward.
decrease
collect
supports
performed
distinct.
coins
x-axis.
character,
triplets
twice
exist.
much
seconds.
request
evaluate
serialization
differ,
makes
difference.
column.
floor
car
vowels
completely
palindrome.
support
arbitrary
root,
circle
simultaneously.
3rd
now
candies
associated
traveling
received
bank
instance
concatenate
say
prices[i]
fn
case,
multiply
complexity
series
preorder
tasked
finding
free
roads
source
stones.
counts
rotating
(from
s.length
(x,
board,
white
d.
arithmetic
arr[1]
(where
end.
turns,
problem,
factors
divides
queries,
and/or
decided
overlapping
vowel
mapping
substring.
houses
stay
vice
zero)
well
combinations
other,
:
s2,
rectangles
axis-aligned
bottom-left
0's.
rules.
'r'
3],
fixed
image
taking
nums[i].
i.e.,
player's
wins
island
duplicates.
indices,
second.
subtrees
vi.
reconstruct
meet
message
perfect
let's
running
cut
started
point.
decode
1's.
num1
enum
tasks
length)
impossible.
across
speed
arrive
query,
course
'#'
""
addition,
vertex
come
rearranged
n].
plane
piles
twice.
id,
subsequent
intervals[i]
column,
'*'
changes
converted
future
parts
earlier
contained
-x
abs(x)
tie
push
pushes
flipping
'a'.
pieces
wins.
format.
(a,
.
degrees
expression,
moment
yi
vi,
fully
missing
stones[i]
stone.
weights
center
direction,
sets
segments
steps.
reachable
'r',
arr[arr.length
recall
chooses
col
range.
reduce
(x1,
able
n).
separate
factor
surrounded
hold
anagram
days.
endi
ranges
us
system.
notes:
hour
descending
decreasing
'c'
west
obstacle
ordering
cycle
judge
implementation
o(log
rectangle.
significant
evaluates
help
ensure
(inclusive)
provided
type.
later
modifying
comes
year
product_id
nested
disjoint
(0-indexed),
triangle
z
inserting
operation:
grouped
have.
formatted
copy
trees.
'd'
nums[i],
below:
checks
labels
label
vi
team
minute,
regardless
impossible,
p.
edge.
anywhere
fn,
record
total.
[fromi,
fromi
satisfying
amongst
picked
ancestor
there.
requests
work
descendant
remain
dollars.
radius
constraints:
bst.
half
give
queries[j]
substrings.
applied
splitting
'x'
cards
size,
1s
indicate
top,
rows.
enter
etc.
box.
manager
alice's
deletions
table,
('a',
nums[1]
alphabet.
o(n)
equivalent
figure
break
b]
plane.
doing
get.
cardinal
is.
did
once,
format:
replacement
lefti
increments
generates
head.
lead
limited
unless
num)
nor
limit.
runtime
country
world
jumps
mean
stack.
achieve.
simple
line,
underlined
optimal
counting
city,
dollars
traverse
9,
9.
(1,
testcases
ball
balls
none
10,
col)
y1)
y2)
garden
intersect
nums2[j]
id.
composed
'.
instead.
(2,
kind
eat
earn
ri
correct.
user.
zeroes
zero,
centered
operations,
(xi,
90
alternate
value)
custom
shape
toward
forming
area.
bi,
'f'
built
r,
again
goal,
multiplication
abs(i
happens
affect
even.
n-1.
cells,
food
rating
goes
answer[0]
answer[1]
algorithm:
mat,
height.
forms
"ab"
passes
score,
whole
people.
cols
increasing.
child.
inputs
condition
allow
opposite
pile.
made.
low
sides
nums[j],
1's,
distance.
characters:
weighted
num2
logs
1000
waiting
mark
hours
tasks[i]
collection
level,
worker
workers
word2
courses
pointer.
job
end,
exact
lose
circle.
card
1])
threshold
online
0s
bag
deletion
towards
nums.length.
task.
doesn't
class.
calling
answer.length
sit
size.
real
differences
[3,
holds
candy
candies.
connection
'('
queue.
names.
repeatedly
nums[j])
(starting
trying
'c'.
money.
duplicates,
public
selected
finally,
"1"
computed
mod
existing
node.val
satisfied:
non-increasing
goal.
linear
one,
median
j]
push(int
pop()
i.e.
sum,
zeros,
tokens
brackets
expressions
variable
palindromes
"ace"
yi,
beginning,
2:
1:
step.
video
finished
endpoints
red
removal
8,
arr1
requirements:
present.
result.
function,
ignored.
10.
shares
(x2,
answer[j]
works
encoding
garden.
partitioning
lines
straight
'.',
(no
present,
examples
sentence.
converting
interpreted
method.
sitting
(both
5]
empty)
groups.
exam.
backward
[li,
allowed.
bottom.
walking
east
horizontally,
previously
puzzle
particular
s1,
equally
'l'
obtain.
lists.
add(int
child,
player.
fill
cities.
corresponds
positioned
neighbors.
1)th
same,
pairs,
pairs[i]
friends,
used.
year.
analysis
reports
them,
individually
appended
lie
leaving
h
differs
ci]
partitioned
anagrams
(or
address
values:
functions.
outgoing
"abc",
independent
allocate
manner.
writing
b),
parenthesis
(a),
order).
in-place
solutions
perm[i]
perm
distances
secret
numeric
phone
11
pivot
coin
compute
reached
far
strs
+----------------+---------+
employee_id
keys.
(see
pieces.
(bst),
x2,
point,
destination.
access
leetcode
word2,
color.
boundary
[uj,
uj
allows
rooms
chose
so,
6.
shift
queries.length
0-indexed.
her
again.
gain
department
[4,
increases
nums)
right)
various
reference
60
n),
enough
arrange
students.
drop
nice
tasks.
treat
(except
log
social
insertion
own
date.
invalid.
queries[i].
varying
chessboard
occupied
removals
above,
"",
2]
rounds
roots
compare
trip
values[i]
black
triplet
arrival
exam
directions:
small
stores
yi].
automatically
full,
be:
operators
visits
tile
itself
'u'
stack,
balance
bank.
accounts
thread
righti
not).
dot
disturbing
conversion
substring,
minimal
p,
api
operator.
neither
gives
sliding
window
10^9
subtrees.
cycles)
loses
'b'.
subtraction
d)
5)
calculator
parentheses,
intermediate
evaluation
231
chunks
simplified
subsequence,
bi-directional
connects
excluding
outer
coordinates.
draw
sorted.
[i,
x-coordinate
(x
position,
multiplied
limit,
simultaneously,
want.
causes
color,
11,
detect
capital
sequences.
mountain
requirements.
falling
diagonally
'-'
similarly
diagonal.
reaching
topmost
turn.
location.
solutions,
thus
token
broken
daily
side.
phrase
(to
salary,
negative.
create.
strength
describe
updates
li
ri]
'u'.
accepted
attend
blocks
street.
facing
moved
movement
returning
constraints
move.
expected
changed.
face
[-1,
perimeter
rectangles.
likely
yi)
quantity
balanced.
nothing
handle
proven
red,
(and
ends,
blue.
neighbor
w
station
|i
provide
respective
arguments
evenly
j),
internal
complement
|nums[i]
cause
reversed.
beauty
neighboring
wall.
walls
blocked
themselves
locations
start,
year,
root-to-leaf
(contiguous)
cross
definition
k-th
stop.
ways:
ladder
transformation
[ri,
subsequences.
dice
strs,
obstacles
direct
nothing.
overlap.
down.
fourth
filling
arrangement
reformat
alphanumeric
shorter
4th
gcd
can't
opening
queue,
weighti]
items.
right].
fibonacci
instances
'd',
"a"
condition.
delay
or,
below,
magic
moves,
zigzag
send
super
teams
text.
endpoint
constraints.
keeping
email
falls
functions:
inputs.
frog
beyond
only,
toi
visiting
marked
decoded
equation
activity
pair.
bus
buildings
office
sent
zeroes.
form:
produce
iterator
selling
quality
speed.
cars
insertion.
unlock
24-hour
tasks,
corner.
resultant
s2.
schedule
prerequisites
maps
respectively
named
connected.
directly.
(i.e
xth
shifting
(represented
minimized
components
problem.
stone,
'l',
planted
lost
40
serialized
[x,
6)
cards,
cards.
traversal,
word2.
merged
memory
allocated
train
dictionary.
server.
age
passengers
units.
alphabetical
vertices,
overall
unknown
fall
balls.
lengths.
events.
at.
completed
space,
library
division.
descendants
met:
"010"
entries
media
instructions
transaction
moment,
rotation.
'u')
coins.
attack
field
objects
2),
positions.
x-axis
calendar
(as
plant
further
percentage
piles,
down).
')'.
^
[idi,
idi
trips
local
toi]
fair
symbol
are:
[c,
happy
specified
crossing
time[i]
"abcd"
preceding
language
wrong
another.
part.
2],
repeats
sold
(inclusive),
round,
happen
nums1.length
[]
chosen.
month
standard
intervals,
places
1-indexed
chessboard.
continues
explanation
kinds
others
(i+1)th
unable
paint
idle.
applies
sizes
computer
price.
meeting
indexed
roads[i]
cost[i]
12,
val;
messages
courses.
divisors
logs[i]
duration
closed
regular
'+',
server
servers
periods
solution.
formed.
interval.
1]).
l,
shop
empty:
indirectly
righti]
execute
reversed
games
account.
i++)
(int
threads:
0;
code:
sub
righti].
recursive
appends
val,
stock.
occurring
milliseconds
milliseconds,
set,
set.
well.
property
area,
pop
constructs
again).
engage
desired
colors[i]
fraction
x).
(4
minus
questions
degree
chunk
[-231,
separating
usual
multiplication,
operator
journey
summation
roads.
passing
timei]
spell
segments.
integral
string:
infinitely
y-coordinate
x)
array's
sub-arrays
hand
'y',
'g',
hand,
green
d,
slices
subarray,
col),
(row
string)
'+'.
c1)
diagonals
matrix's
xi.
y).
compressed
flower
flowers
grow
integers:
float
continuously
sentence,
valid,
('a'
digits).
seats.
seat.
stand
people,
eating
manager.
employee,
display
teacher
forward.
user,
shuffled
mapped
minutes,
distance,
x1
x2
event,
valuei.
top.
street
origin
euclidean
ever
command.
sign.
discount
discount.
price,
spaces,
non-space
get(int
key)
key-value
arr2
cycles
right),
judge:
itself,
immediate
unlimited
candidates
j).
tower
ugly
-1].
subset.
huge
alphabetically
expression.
via
target)
picks
picking
spiral
j|
from.
different)
avoid
will:
postorder
house.
tickets
buying
languages,
hamming
known
u
paired
image,
self
infected
list's
brackets.
string[]
sales
product_name
unit.
wall,
nesting
deeply
flatten
wikipedia:
task,
vice-versa.
si
rain
result[i]
(ri,
receives
triangle.
main
die
rolls
roll
ordering.
dots
initialized
error
code.
paths[i]
indices[i]
lowercase.
banned
process,
place.
nums.length,
furthermore,
ranking
added.
sequentially
better
spend
structure,
ability
everyone
three.
"hello",
(bst)
negative,
getting
generator
yields
constructor.
right]
perm[i
'i'
q
corner,
treated
endi].
result,
mathematical
'+'
message,
nums2[i]
nums1.
boundaries
arr[k]
knight
diagram
reversing
trivially
pile,
labelled
team.
high,
[low,
a[i]
unoccupied
26
title
27
gap
through.
109.
solution,
assignment
peak
emails
statement
rectangles[i]
validate
'f').
recent
themself.
factorial
criteria:
signifies
records
(even
grid[r][c]
toi,
lowest.
baskets
tree)
num[i]
'x'.
website.
timestamp.
machine
timestamp
n-ary
nary-tree
traversal.
you.
tests
break.
erasing
formula
hasnext()
next()
acyclic
pricei]
pieces,
difference,
coordinate.
road.
insert(int
root)
security
whenever
close
["abc",
workers.
border
component
num2,
minute.
'p'
anything.
overlap
composition
aforementioned
vj
prefix.
in.
freely
expansion
each.
high
pointers
jobs
skip
rolls.
downward
entering
8.
+-------------+----------+
right).
30
20
[5,
'y'
start.
intervals.
stream.
"2"
card.
depth.
strange
view
string).
(empty
s3
shuffle
6]
arr.length.
finds
rounds.
track
decreases
ranks
calculates
look
this:
remove.
language.
restaurant
customer_id
seven
customer.
passenger
ten
min
however
store.
satisfied.
levels
bags
bag.
box,
remember
robber
executed
execution
lodash's
submatrices
eats
turned
shifts
(wrapping
algorithm.
else
bob,
's'
section
files
checker
root1
triple
(r
orders,
non-empty.
container
transactions.
-1,
piles[i]
nums[n
configuration
puzzle.
available,
robots
nums[nums.length
lands
booking
my
[start,
causing
attended
4]
hidden
unsorted
vertex.
appeared
pi
typed
employee_id.
twice,
win,
ended
considering
system,
connect
full.
water,
bob's
threshold,
content:
triplets.
school
assigning
keys,
json.parse.
car.
travels
amount.
includes
supply
visible
i]
two-dimensional
(that
crosses
boxes,
ones,
lengths,
inorder
subarrays.
dates
login
dropped
amount,
customers.
actually
planning
rob
appending
encode
coming
stones'
stops.
hold:
[1,2,3,4]
has.
rotations
deletes
keeps
domain
expressions,
away
vj]
net
eight
104
slots
50
guess
connections
threshold.
order_date
finishes
removed,
h.
ball.
candies,
counter
solving
instead,
properties
(non-empty)
over.
'o'
painted
painting
compared
keyboard
domino
')',
work.
original.
versa.
balloons
price[i]
averages
all.
sentences
hello
"hello
memory.
i-th
palindrome,
and:
(1-indexed).
choice
')'
'*',
restricted
'-',
minimum.
false,
refer
f
two.
text,
startpos
unfortunately,
manner:
simply
12
hours.
hour,
numerical
frequencies
bad
-->
date,
arrows
floors
interested
shop.
endi,
cuts
collected
islands
state.
nums2[i].
'e'
beautiful.
pricei.
condition,
hours,
summary
accounts.
amounts
account
alternately
splits
[1,2,3,4,5]
function:
26.
m)
p1
hash
transaction.
profit,
error.
promise
asyncronous
0.5
types:
country,
jumping
jumps.
once).
[2,3,4],
2.5.
window.
diff
uniquely
flipped
vals
paths.
calculation
denominator
quadruplets
disconnected.
height-balanced
pairings
scores.
"0"
lexicographic
printed.
[].
variables
terms
basic
unary
lexicographically.
"abcde".
travel.
less.
timei
cities,
3:
(minimum
[1,2,3]
aligned
requires
endpoints.
1))
s[i
steps,
maximized
64-bit
yellow
arr1[i]
arr2,
"123"
necessary
whitespace
determines
converts
r1
r.
c),
(r1,
turns.
draw.
(ai,
manhattan
multiple,
run-length
"aa"
times)
marking
bloom
parents.
+-------------+-------+
righti.
all)
'-'.
('0'
hands
holding
phrase,
typically
days,
apples
eat.
eaten
positive.
startvalue
ranges[i]
ranges.
i1,
i0,
strength,
performed.
asks
company.
show
clock
traveled
events[i]
inclusive:
blocks.
bottom,
street,
plots
plot
'0'.
obstacles[i]
units,
simulation
obstacles.
direction:
cache
capacity)
capacity.
put(int
expectednums.length;
expectednums
pass,
expectednums[i];
assert
assertions
[...];
parent,
shapes
shapes.
tiles
"aec"
"abcde"
left-to-right
't'
libraries.
behind
erase
short
shuffling
way,
uncolored
(either
dimensions
stations
to:
trip.
star
subgraph
colors.
painted.
product,
2's
integer's
notation.
therefore,
(also
nums[j]|
friends.
preferred
image.
invert
items[i]
spreading
walls.
boundary.
shared
reduces
routes
fuel
listed
x[i]
y[i]
sale
inclusive,
upper,
drawing
bricks
flattened
arr[j].
recursively
occupies
mouse
wordlist
wordlist,
wordlist.
touches
str1
ip
restore
addresses
targetsum,
targetsum.
===
seq
(for
n-1
n-1,
banned.
heighti]
non-intersecting
belonging
groups,
ranked
count.
100,
beginning.
room.
student.
holds.
closing
hi
people[i]
more.
item.
frequently
dividing
methods:
into.
non
reminder,
few
13.
instance,
overlap,
21
i:
perm.
di
starti.
requirements
part,
"b"
required,
message.
elevation
forgot
odd.
attain
cell).
chess
movements
true,
environment
contents
children,
signal
inclusively.
z.
z,
excel
sheet
successive
spread
escape
done.
'?'
'?'.
non-negative.
program.
printed
magical
edges[i].
address,
upper-case
4],
intersect.
retrieves
tweet
feed
list<integer>
tweets
xored
filter
i)
monotone
checked
to,
int[][]
c2)
income
paid
bracket
rate
s[j]
conditions,
-1]
follow:
fruits
owner
pick.
basket
parent[i]
callback
throws
used:
resolve
executed.
done,
'e'.
factory
website
bus.
restaurant.
request,
working
years
project
experience
project,
him
obtaining
wide
evaluating
question
session,
finishing
procedure:
[1,3,5]
combination.
graph[i]
prices.
cutting
recover
consecutively.
distinct)
entirely
maximum.
combinations.
driving
speed,
drive
speed[i]
assumed
catch
last,
"hh:mm",
parity
directions.
grid[row][col]
y-axis.
y1,
(product_id,
store,
exists)
tuples
money,
nums[i+1])
bounded
prerequisites[i]
take,
numcourses
mm
00:00,
23:59.
basket.
pointer,
on,
i).
difficulty
'9'
values).
tallest
nums:
where,
non-leaf
correspond
in-order
constraint
dies
immediately.
enters
captured
split.
pair,
-3,
deserialize
parser
deserialized
violating
[3,2,1]
live
serialize
'#'.
9],
thus,
kilometers
dist[i]
dist
a2,
(there
back.
triangle,
word1.
imagine
list1
free.
departments.
department.
uncommon
others.
"abc".
selecting
dictionary,
words)
pref
majority
implementing
arr[left...right]
counter-clockwise
held
0's,
lying
6-sided
whereas
nums[left]
videos
found,
gcd(x,
day).
n2
details
pop,
floor.
width,
type,
r2,
pointing
individual
customers[i]
knows
exchange
searchword
vertices.
words[i].
odd-indexed
even-indexed
bags.
nums[0],
nums[1],
[nums[k],
2-d
content
content.
available.
delayed
x1,
submatrix
status
'a').
'u',
applied.
alphabet,
dead
finally
x's
plants.
plant.
len
matrices
password
four.
division,
orders.
decrypt
(user_id,
viewed
edge,
each,
precedence
yi],
queens
queen
"0",
pickup
partitions.
distributed
adjacent,
a[1],
1s,
contrast,
left).
end)
calendar.
successfully
half-open
book(int
blank
competition.
delivery
can.
capacity,
river
7]
"("
"o",
pressed
parameter
b:
(5
'9'.
half.
designed
participating
lies
favorite
bitwise-xor
parents[i]
genetic
subsequence.
milliseconds.
queries[i],
(bitwise
arr[i].
container.
restrictions
try
file.txt
script
times).
trips.
'w',
board[r][c]
buses
formally
n],
ratio
maximizes
json.
deep
valued
positioni
liters
[positioni,
link
digit,
coin.
d]
squares,
diff.
map,
volume
represent.
subjected
representations
rooms.
room,
'|'
on).
context
logged
river.
free,
non-empty,
"abcc"
increasing,
subtree.
nums1,
nums3,
a.
begins
(this
judged
importance
rearrangement.
comprise
(nums[i]
axes.
cycle.
edges[j]
endtime
depending
1-9
flowers.
arr[j
folders
(you
7],
forever.
positions[i]
hire
costs[i]
worker.
buckets
police
night.
alerting
contact
police.
planting
determined
attributes:
(but
front,
[xj,
nums1[j]
members
seats,
arriving
pays
customers,
positive,
mat[i][j]
deleted.
"leetcode.com"
(an
represents:
simplicity,
occupy
collide
device.
'0's
chessboard,
moving.
25
(3
itself).
(excluding
friend.
connections[i]
comprises
simulate
adjacency
123
alternating,
"0100"
adjacent.
0-indexed).
arrays:
enhances
relationship
[rowi,
coli]
good.
word's
pos
past
someday
allowed).
mat.
restriction
format,
input/output
+=
implemented
deque
upcoming
balloon
visited.
offers
cost,
sentences.
world",
world"
similar.
actions
lucky
white.
requests.
t)
happened
words[j]
{0,
nums[i+1]
accept
climb
(each
course.
persons
guards
(horizontal
'.'.
square,
action
staying
matter
val]
val:
forest
possibilities
"alice"
'@'
3sum
handling
don't
event.
getrandom()
island.
not,
merging
truncate
off.
sequential
singly-linked
val2
val1
etc.).
lock,
lock
"00",
six
500
'(',
coordinates,
hour.
losing
directory
code,
bar
unit,
repetition
ans.
robot.
unchanged.
reset()
heights[i]
hi]
sticks
stick
normal
folder
n-1).
r)
reuse
break,
competition
domino.
salaries
8]
[startrow,
save
identify
shop,
executing
respect
person,
vertically.
islands.
(representing
distribution
starttime,
movies
+----------------+----------+
movie
stays
worked
force
pushed
taken.
objective
floor,
preparing
alternating.
guarantee
methods
user_id.
1][n
grid[m
height,
tell
relations
seconds)
2-dimensional
locked
chain
called.
t1
critical
west,
employee's
(note
deepest
(empty)
(left
yj
subgrid
"a",
employees,
leaves.
process:
redundant
parameters
bit.
unrooted
level.
fractional
ride
chars.
1d
(binary
language,
sn
&
(such
counterclockwise
giving
tells
res
divisors.
network.
reading
though
meeting.
structurally
involving
transferred
set).
subsets.
[2,3,5]
term
power,
fancy
idx
differing
parts.
later.
reject
...].
pow(x,
c++
maintain
population
million
big
(index
3rd,
4th,
5th,
odd-numbered
legal
[1,2,3,4],
stack's
arrangements
pre-order
vals[i]
path).
piece.
wins,
subtraction,
nums[a]
nums[c]
nums[b]
|y
bi],
x|
[2,4,2]
[2,7,4]
elements),
elements'
[4,2,3,7,2,1,4]
subtraction.
multiplicity.
coefficient
order:
evaluated
ties
"1
variable,
ignoring
fee.
maxtime
salary.
[typei,
remove,
traversed
bob.
smash
destroyed,
button
dial
ring's
align
ring
press
n-1)
covers
huge,
(6
clear
s[k]
finite
(targetx,
20.
intersecting
digits[i]
hand.
form,
arr2[j]
capital,
2).
s)
function).
ignore
-231,
non-digit
hit
bi).
cartesian
satisfies:
compress
"ccc"
compression
flowers,
cousins
lines.
attribute
factors.
extended
answers[i]
powers
mark.
"."
valid).
images.
booleans,
object,
json
temperatures
3),
apple
rotten
managers
managerid
returns:
inclusive)
ik
queries.length,
(id,
angle
valuei].
starttimei
a's
b's
triangular
patterns
pyramid
stacking
block.
allowed,
pyramid.
stacked
placed.
words[j].
redistribute
south
north.
-1:
obstacle,
north
25).
xy-plane
yi).
squared
versa,
dollar
single-space
updated
a[0]
or.
a[a.length
a[1]
recently
cache.
initialize
exceeds
arr2.
distinct,
accepted,
important
things:
monitor
install
3d
surface
cubes
solved
solved,
distributing
bi)
pick()
v]
[u,
logical
45
comparing
80
faster
layer
layers,
search(int
search.
coloring
stations[i]
position[i]
songs
song
bonus
ascii
lined
furthest
ticket
1-indexed).
implementation,
compiler
unsigned
-3.
unsigned.
java,
|val|
copies
pairing
v.
prefers
[1,1,0]
[0,1,1]
[pricei,
queries[j],
spreads
installed
regions.
installing
region
contaminated
tie.
finish.
have,
innermost
y[i],
alphabetic
food,
food.
sale_id
year)
(sale_id,
partition.
chunk.
partitions),
upper]
[lower,
bricks.
brick,
brick
multi-dimensional
cited
h-index
h-index.
paper
citations[i]
researcher's
citations
papers
researcher
published
(i-1)th
groups[i]
considered.
mouse,
players,
cat
are.
endword
beginword
sk
endword,
sea
lot
c).
ci)
borders
str2,
str2
z)
transpose
faces
same)
"192.168@1.1"
addresses,
"192.168.1.1"
255
addresses.
incremented
!==
throw
paths,
indexing
replacements
"ab",
"abcd",
"eee",
"bc"
independent,
seq[i]
banned,
book
increased
fifth
proved
s1.
into,
dashes.
dash
reformatted
uppercase.
locations.
location,
tracker
tracks
added,
quantities
decrements
students[j]
seats[i]
root.val
evenly.
[2,5,10]
[1,2,1,2,4,1,5,10].
mine
collecting
"(()))"
ki
queue).
[hi,
hi.
extension
applications
"hello"
sometimes
deletion.
weighti],
element)
contains.
col1,
row1,
row2,
constructor
substrings,
smaller.
'z'.
xn
[1,2,3].
binary.
bits.
mirror
laser
q,
yield
unequal
rising
fall.
secret.
j:
range,
pad
parsed
16
times[i]
wi
skill
skills
high].
(indexed
creating
decomposition
chunked
immutable
matrix)
type:
inclusively
own.
0-based
a.length
ri].
play,
play.
positions).
subsequence's
aa
28
touching).
former
latter
situated
movecost
refers
supposed
matter.
driver
email.
wi.
wi]
must:
hexadecimal
pairwise
nums[k],
nums[k].
0's).
moves).
feed.
user's
post
tweets,
memoize
memoized
cached
x1|
y1|.
attendance
'p':
late.
('l')
absent
eligible
award
'a':
late,
('a')
'l':
late
absent.
absent,
oranges
fresh
orange.
[1,3,2],
encoded[i]
fn(arr[i],
mines.
mines
none,
sign,
node2.
node1
(r2,
cols,
scores,
floating
s[0]
produces.
baskets.
fruit
choice,
baskets,
fruits[i]
parent)
321
cancel
cancellable
thrown
wish
error,
function's
shouldn't
const
0].
equation,
9).
activity_type
machines
run.
activities
processes
exceeding
bus,
buildings.
"011"
permutations.
+------------------+---------+
replaces
contest
"name"
key's
quotation
(without
consecutively
examples)
sessions
session.
session
displays
preorder,
cases.
stands
formula.
arguments.
width.
prices,
y2.
y1
reachable.
miles
one-lane
car's
ahead
away.
fleet.
fleet
filled,
v)
treenode
worker's
person's
period,
(all
necessary.
n2.
completed.
workers,
complete.
column).
num2.
truck
'm',
glass
moment.
clear,
x-axis,
[x1,
fill,
procedure.
remaining,
tuple
nobody
abs(nums[i]
nums[index]
maxsum.
prerequisite
insert(string
map.
prefix)
23,
00
hh
59.
"hh:mm"
mid,
plan
ant
4sum
want:
high.
doubly
job,
target[i]
met.
partitions
'5',
'7',
'3',
'2',
self-edges
rods
requests[i]
subarray's
lcm
upon
drops
guarded
knight's
8)
components.
'm'
17,
|arr[i]
m|
|arr[j]
mini
[2,3,1]
iteration,
120
commas,
comma-separated
non-null
eliminate
a1,
addnum(int
circle,
uniform
circumference
y].
y|.
|x
"11106"
grouping
a-z
(11
ways).
"06"
into:
"aajf"
06)
"06".
"kjf"
"6"
"26"
mapping:
zero).
pascal's
shown:
examples).
farthest
printer
101
list2.
heads
('y',
'n',
department,
"aeb",
"aebdc",
"aebdc"
'o'.
cars.
fulfilled:
index:
suffix.
searches
efficiently
arr)
query(int
l)
example).
k1
+1
k2
items,
missing,
n!
reward
numarray
update(int
nums[left
numarray(int[]
nums[right]).
sumrange(int
videos,
videos.
⌊n
base.
optimize
minimizes
solution(int
cells:
growth
repaired.
repair
allotted
provides
15.
details.
passengers.
top()
rule.
c2.
c1,
c2,
construct.
wasted
want,
cases,
throughout
(n,
clone
cloned
products.
minimums
subgraph.
neighboring.
bag,
distributions.
nums.length)
nums[k-1]]
nums[k+1],
nums[n-1],
spanning
spans
corners
dropping
shaped
realized
houses.
inside.
cookies
awesome
s[j].
seat,
manages
30ms,
400ms.
100ms
50ms,
different:
maze
entrance
exit
cheese
mouse.
bulb
presses
bulbs
...).
switcher
appearing
shifts[i]
nice.
scheduler
birth
older
family
death
king
successor
lca
“the
itself).”
(lca)
indices[i],
strong
password,
root2,
complement.
"101"
triples
a2
b2
"abc
[widthi,
numerically
customer,
ordered.
at,
('1'
will,
sensitive,
"a".
you're
partitioning.
instructions.
inverse
views
transactions[i]
transaction,
destination,
s[i+1]
-5,
removeduplicates(nums);
k;
kept
operates
categories
3n
n-queens
"01",
"123",
password.
incorrect.
protected
typing
entered
safe
checking
circular.
cherry
cherries,
cherries
"ab".
1s.
green,
deck
white,
worth
[0,1,2,4,5,6,7]
a[n-1]]
[a[n-1],
a[2],
[a[0],
become:
a[0],
a[n-2]].
minimal.
home.
home
diameter
booking.
end),
events.).
slashes
'/',
regions
array)
expressed
gains
draw,
drawn
placement
speeds
engineer
efficiency
pj
limitj
refill
watering
plants[i]
needs,
plant,
plants
attend.
startdayi
[startdayi,
backwards
hidden,
office,
office.
entry
spent
probability.
vertex,
forever
biggest
market
"cd"
modifies
"bc",
"d",
"aaa",
righti,
output:
105
s[lefti...righti]
input:
explanation:
p2
")",
"()"
command,
examine
keyboard.
reporting
null).
a:
prints
printnumber
c:
console.
'n'
arr[2]
because:
decrement
rearrangement
votes
again,
positions,
tied
parents,
root).
pi,
capacities
descendants.
lists,
linked-lists
().
).
(
operation).
two,
restrictions,
restrictions[i]
building.
lines,
file.txt,
possibilities.
boomerang
(by
taxi
f(x)
drives
trips[i]
trips,
reordered
budget
characters).
vertical,
legal.
(horizontal,
arr[j],
departure
arrives,
departs
classes
equality
check.
quote
>.
tank
gas
liter
stick,
trimmed
trim
remain.
reset
sure
coins,
fewest
denominations
covering
[firsti,
flight
flights
firsti
squares.
0-indexed,
and.
ingredients
ingredients.
tag
angles
browser
counterclockwise.
doubled
trap
raining.
trapping
(ignoring
data,
data.
matrix[i][j]
rooms[i]
waste
slice.
'|'.
'1'.
"1",
calculation.
decreasing.
quantities,
remove(key)
undefined
appropriate
output.
"the
obj
successful
strengths
old
waits
warehouse
bridge
warehouse,
efficient
wonderful
all,
halves
broken,
words1
words2,
pig
interface:
attempt
parent.
through,
newnums[i]
newnums
newnums.
widths
parents[0]
rectangle,
xi+1
123.
starttime
starttime[i]
00:00
ranging
obeys
nine
repetition.
sudoku
sub-boxes
flowers[i]
arrives.
arr[1],
represents.
folders.
'/'
folder,
15
tournament.
route
landing
lefti.
22
candidates.
fed
bucket
including)
amount)
prices[i].
bought.
sale.
bill
professional
house,
tonight
transformed
original,
gardens
gardens,
sequence:
"12",
binary,
party
procedure
party,
predict
strategy
smart
skipped
vote
distance[i]
index)
next.
insertion,
words.length
choice.
5].
pushing
middle,
rational
express
anywhere.
(xj,
ideal
maxsize
respecting
summing
sub-array
flips.
nums2.length.
member
picky.
customer's
richest
month.
serving
wheel
operating
ground
solution(int[]
convenience,
question,
e2,
variable.
e1,
parse
e1
concept
sequentially.
car,
collides
slowest
seconds,
meters
subject
subjects
university.
permute
coprime,
coprime
bank,
rows:
'1's.
interfere
join
change,
mutate
0-9
uniformly
attempts
stopped
matched
word.length
serve
1000,
x:
friend's
guess,
guess.
independently
pattern.
here
bijection
definitely
answer[x]
time).
trees[i]
strs.
company,
order_id
related
ends.
graph[i][j]
m(initial)
m(initial),
m(initial).
malware.
malware,
malware
leaf.
trees,
"1010"
quarter
2019.
seller_id
buyer_id
removals.
visits.
forth.
brings
dictionary)
search(string
closed,
candies[i]
keys[i]
8).
(6,
invalidate
questions.
question.
everybody
then:
sums.
moves[i]
tic-tac-toe
primes.
summer
(labeled
mail
case),
emails.
cooldown
cpu
arr1.length
[3]
temperature
good,
parameter.
internally,
tail's
active
traversing
step:
partial
copied
tiling
pizza
anti-clockwise
endi.
called,
undefined.
(bst).
sub-tree
serialization/deserialization
transmitted
environment.
reconstructed
buffer,
robbing
api.
2k
successful,
isfull()
isempty()
loss
next(int
price)
timei.
frame.
meeting,
meetings
meetings[i]
unrevealed
balloons.
burst
bursting
bounds
special[i]
shopping
item,
buy.
country.
route,
stations.
station.
removal.
segment.
rule:
parts:
arr:
[1,2,3],
colsum
*left;
*next;
populate
populating
struct
*right;
ancestors.
parents
"high
rank.
weight,
likes
15,
equivalent,
reused
segmentation.
worddict,
space-separated
divisibility
deletions,
["bef",
["abcdef","uvwxyz"]
3},
1]),
"vyz"].
answer.length.
[nums[i],
wiggle
staircase.
stairs
climbing
wooden
triangles
obstacle.
time].
non-decreasing.
directly,
computing
104.
disconnect
(0).
island,
joined
specify
snake
simulates
ladders
ladder.
digits:
projects
collisions
stationary
24
particular,
overlapped
truncates
'/'.
calculations
[isleaf,
isleaf
topleft;
quad-tree
val].
photo.
sub-grid.
besides,
isleaf;
topright;
terminator
proper
sub-grids
bottomleft;
0's)
recurse
bottomright;
isleaf:
wiki.
quad-tree,
got
leads
land.
(left,
cells[i]
1-based
modifications
union
forest.
prefixes
tiles[i]
tiles.
communicate
center,
line:
address.
besides
worry
simplicity
bash
order)
nums[0]),
remove(int
getrandom
100.
scheduling
'a')
now,
eval().
turning
needed.
intersections
high]
head)
contour
city's
viewing
skyline
round.
tournament
advances
case.
s).
stamping
0-9,
amounti
'0',
'1',
"001",
"1"],
["0",
"001"
"happy
themselves.
cipher
unique,
900.
xii,
(10)
(500)
numeral,
v,
principle
numerals
symbols:
xx
xxvii,
numeral
400
nine,
(1000)
(100)
(50)
(5)
usually
90.
ii.
roman
ix.
iv.
iiii.
'['
special,
black.
tournament,
gone
tokens.
pattern,
performs
initial.
here,
tab
directories
file/directory
ice
cream
bars
depths
"()(()())"
vps's
vps
depth("")
vps)
")")
vps's,
max(depth(a),
depth(s)
"(()"
depth("("
vps.
depth(b)),
")("
depth(a
(denoted
depth(a),
"()()",
vps's.
21.
"acb",
collision
happens.
polygon
convex
reside
back,
url
history
visit,
identical.
interface
(every
originally
duplicated
ans[j]
server,
partially
growing
count()
abbreviated
resets
lower-case
great
infinity.
[arrivali,
arrives
for:
chalkboard
chalkboard.
columns,
enemy
army
weakest
successful.
programming
periods.
sold.
"10".
farmland,
designated
stonevalue.
service
pyramid,
flat
arrow
shot
egg
eggs
certainty
unbroken
breaks,
inputs:
opponents
energy
training
asterisks
dominoes[i]
dominoes,
company's
departmentid
else,
pixels
fibonacci-like
stock,
3x.
(startrow,
cost.
startcol]
startcol).
puts
circular,
null,
disconnected
profitable
leftover
prefix,
sends
ages[i]
passed,
2].
referred
jobs,
batch
penalty
"fizzbuzz"
"fizz"
fizz
buzz
"buzz"
guesses,
guessed
took
(north,
[rowj,
half-closed
colori
describing
durationi
constraints,
cycles.
make.
cuts.
instruction
executes
execute.
ship.
port
package
load
packages
ship
(5,
(4,
garden,
32
(c,
(meaning
maxdistance
row-wise
(land)
(a)
distinct).
k-sum
balls,
ball's
numsl+1,
[numsl,
numsr]
numsr-1,
scheduled
grid[i
grid[i][j
cinema
movie,
record.
'd'.
40.
grammar
×
user_id)
parent[0]
cook
chef
processing
reply
newly
processed.
idle
servers.
seed
2h
walked
threads
molecule.
three,
threads.
indexes
messages.
time_stamp
datetime
time_stamp)
tries
grid[0][0]).
ai.
region.
capture
piles[i].
tree's
dashes
',
till
visit.
traffic
boxes.
erasure
completing
"leetcode"
single-threaded
buildings,
zeroes,
carries
february
2020
rooms,
preserved.
necessary).
k-1
divisor.
gcd(nums[i],
equations
equations[i]
cj
candy.
extending
y-axis
multiples
contains,
natural
vii
levels.
expiration
val2.
rook
vertically,
(r+1,
subordinates
halve
reduced
compact
objects.
numbers:
formats:
partial).
y]
xy
processed
11.
top)
't'.
group[i]
fashion.
|xi
xj
xj|
'5'
's',
2020.
boxes[i]
starts,
init.
extract
apple.
mean:
stones,
profit[i]
"c"
strings:
info
directory,
t2
meetings.
index1
index2
popped
movie.
movies.
piles.
separation
balanced,
[i
cheapest
decrypted
permitted
132
nums[2
parenthesis.
race
popular
withdraw(int
transfers
incoming
deposit
withdraw
divisors,
player_id
games.
device_id
event_date
event_date)
in,
logging
games_played
(player_id,
questions,
20,
of:
locks
criteria
mass
mass,
asteroid
asteroid,
asteroids
existed.
[starttime,
freq
[10,
endtime)
verifying
elimination
robots.
heighti
non-equal
flip()
occurs.
prepending
"aba"
bomb
effect
peek()
quantity,
soldiers
relationships
divisor,
-2.
layout
stamps
"xxxx"
chars
chars,
queue's
(j
cups
cup
head,
13,
like.
rented
source[i]
"0".
(one
'x',
rows,
so.
(here,
scores[i]
preserving
edit
weighti.
here.
"cba"
flood
endi],
problem:
backspace
poor
attacking
non-overlapping.
monthly
(double-ended
natively.
stacks
empty).
peek/pop
supported
(push,
empty()
queue)
sub-arrays.
iterates
conflict
liquid
plate
vj.
intersection.
(more
yyyy-mm-dd,
sentences,
computers
floating-point
pool
find(int
there?
"aab"
swaps.
totally
robot,
recursively.
parentheses.
identical,
toi.
employees.
s1[i]
yj]
changes.
bst's
retrieve
instructed
defines
effective
folder.
symbols
rests
duration.
trans_id
transacted_on
10000.
foobar
print("bar");
foo(),
bar()
foo()
print("foo");
bar().
n;
"foobar"
newi.
oldi
mappings[i]
mappings
sub.
newi]
mappings.
[oldi,
score:
belowi],
abovei
colconditions[i]
rowconditions[i]
belowi
given:
rowconditions
colconditions
[abovei,
[1,5,3]
(ie,
"say"
"3322251":
countandsay(n)
saying
count-and-say
countandsay(1)
formula:
countandsay(n-1),
pk-1)
val('z')
val(s[k-1])
(val(s[0])
val('a')
p0
modulo)
modulo,
hash(sub,
hash(s,
sub,
val(s[1])
val(s[i])
hashvalue.
append,
append(val)
getindex(idx)
multiplies
multall
fancy()
addall(inc)
inc.
addall,
multall(m)
possible:
fullfill.
exceeded".
"time
addback(int
smallestinfiniteset()
popsmallest()
smallestinfiniteset
exponent
**
0.5)
python.
sqrt(x)
"inner":
"leaf":
"root":
p_id
multiplicand.
abs(nums[i])
interesting
belongs,
3000000
population,
25000000).
twenty-five
continent
km2),
countries
countries.
bigint
gdp
...)
numbered,
...),
even-numbered
jumps,
(2nd,
(1st,
6th,
examples,
nums[i,
i].
particularly,
subtracted
nums[0,
diff[i]
stack-like
freqstack()
freqstack
(1-indexed.)
it.)
(recall
transactions:
[-1].
effect:
voyage.
voyage,
irreducible
2/1.
fraction.
nums[d],
maxdoubles,
maxdoubles
[4,2,5,3]
(after
subsequence).
reindexing
mentors
(yes).
survey
mentor's
mentor,
(no)
student-mentor
mentors[j]
compatibility
mentors,
student's
achieved.
students[i]
mentor.
question's
mentor
evalvars
["-2*a*a*a",
3"
{"e":
symbols,
"e
"-6"].
"2x"
"a*b*c".
alternates
breaking
"-x".
terms)
["e"]
well-formatted
asterisk
term.
"4*a",
(given
exist.)
"5*c",
included.
[1]),
"b*a*c",
"3*a*a*b",
1}
"a*a*b*c"
digits.)
multiplied,
["7"].
coefficient,
5"
evalints
"3*b*b",
symbol.
["-1*a","14"]
forwards
length-3
backwards.
[1,3,2,1].
1321,
array-form
maxtime,
journey,
passingfees[j]
fees
cities).
passingfees
passingfees,
salary[i]
ui,
edges:
traversable
typei
excluded)
[-1,2,3].
mex
[1,0,3]
[-1,2,3]
key[i]
quest
(next
place,
pressing,
trail
keyword.
key[i].
spelling.
spell,
"freedom
purpose
stage).
spelled,
metal
engraved
freedom
ring"
key[i]:
door.
button.
fallout
"road
stage
anticlockwise
pressing
freedom"
"12:00"
keyword
1-d
6).
69
corner).
8-directionally
0))
points:
targety)
targety
targetx
min-product
[3,2,5]
(3+2+5)
insufficient
'551',
'1351315'.
'13',
['1','3','5'],
zuma.
zuma,
turn:
variation
'w'.
zuma
|arr1[i]-arr2[j]|
capitals
holds:
"usa".
capitals,
usage
"leetcode".
"google".
[1,3,5,7,9],
[3,-1,-5,-9]
[7,7,7,7],
mountain.
left/right.
ramp
clamped
atoi
myatoi(string
reached.
clamp
"0032"
whitespace.
123,
either.
32).
read,
-231
(similar
(atoi)
c/c++'s
bottomright[r][c]|.
answer[r][c]
topleft[r][c]
bottomright[r][c]
|topleft[r][c]
zero-filled
player1
player2,
bowling
2xi
pins
unreachable
x2)
grid:
abs(x1
abs(y1
y2).
answer[j])
(answer[i],
"a2"
(repeated
"c3".
"aabccc"
run).
(length
"a2bc3".
bloomday,
bloomday[i]
bouquets
bouquet.
bouquet,
bouquets.
cousins'
comparisons
search_cost
line).
lines:
uncrossed
nums2[j],
(non-horizontal)
given)
pid
holder's
investment
tiv_2016
policyholder
2015
policy
latitude
policyholders
(lat,
2016.
longitude
tiv_2016,
policyholders,
unique).
lon)
policyholder's
lat
who:
2016
lon
tiv_2015
investments
insurance
(assuming
1-indexed)
powers,
powers[j]
square-free
("ab,",
"a!",
marks
"afad",
'z'),
"c.,"
hyphen
','),
('!',
punctuation
('-'),
('
"ba-c",
"-ab"
"cd!",
')
("a-b"
"a-b.",
'9'),
"ab-"
hyphens,
"a!b"
"!".
hyphens
converting,
10)
inludes
object.keys().
json.stringify
objects,
temperatures,
warmer
temperature.
switch
couples
couple
row[i]
(2n
hands.
grows
rot
apples[i]
away).
eaten.
apples,
doctors
days[i]
managers.
earning
signfunc(product).
signfunc(x)
display.
calculator.
nums[i1]
nums[i0]
nums[ik].
nums[i2]
i2,
lengths[i]
queryindices[i]
queryindices
querycharacters[i].
querycharacters
vowel.
unique_id
identifier
unique_id)
employeeuni
mapping[i]
jumbled
degrees)
travellers
travelled_distance
"distance".
rides
most-significant-bit
[1,0,1],
booleans
least-significant-bit).
x0
nums[0..i]
[starttimei,
endtimei,
beneath
pleasing,
(right)
transition
aesthetically
three-letter
"bac"
(left)
plot,
plots,
-2:
commands:
+y
degrees.
9:
-y
+x
cornered
one),
exclusively
"$1e5"
'$'.
"$",
"$100",
"$23",
preceded
"$6"
discount%
"100",
bitwise-or
lru
lrucache
evict
(lru)
lrucache(int
arr1.
(up,
k);
removeelement(nums,
sort(nums,
...;
val);
actuallength;
in-place.
equaling
camera
cameras
150
cubes,
cubes.
irregular
glue
[[1,2,3],[4,5,0]].
solved.
[1,2,3,2].
[2,2,3,4].
deviation
otherwise:
incompatibility
incompatibilities
subset's
evil
evil,
rects)
solution(int[][]
rects[i]
rects
xi,
rects.
inner
parsing
subexprn)'
subexprn
'!(subexpr)'
shapes:
subexpr2,
subexpr.
'|(subexpr1,
'&(subexpr1,
subexpr1,
situation.
performance,
treap
o(log(n))
layers
https://en.wikipedia.org/wiki/skip_list
skiplist
add,
kalinin
skiplist.
comparatively
[cc
skiplist:
artyom
skiplist,
commons
[30,40,50,60,70,90]
by-sa
red-black
wikimedia
fine.
o(n).
idea
skiplists
erase(int
3.0],
skiplist()
node.)
(red
if)
pickindex(),
sum(w).
0.25
0.75
75%).
w.length
w[i]
25%),
presented
(clockwise),
powered
sanctioned
government
|7
10|
|3
pre-existing
5|
stations,
chips,
position[i].
chips
chip
played.
playlist
playlists
boredom,
music
listen
songs.
multipliers[1]
multipliers[0]
multipliers
multipliers[i]
uni-value
uni-value.
1000.
bonus.
empid
supervisor
argumentslength
graphs
beautifully
odds
tickets,
(which
tickets.
ticket.
tickets[i].
instantaneously)
buy,
queuing
weight).
n-digits
1337.
nums[j]),
k-diff
(nums[i],
but:
unhappy.
unhappy
preferences[i]
preference.
preferences
[1,0,0].
inverting
[0,1,1].
queries[j].
beautyi]
counts[i]
night,
limited.
(continuous
infected,
resources
isinfected[i][j]
quarantine
modeled
night).
cells)
threatens
isinfected,
wall)
uninfected
rapidly,
affected
virus.
virus
changed.)
|locations[i]
finish).
locations[i]
locations.length
locations[j]|.
highest-rated
cuisine
newrating)
changerating(string
foods[i]
highestrated(string
cuisines
cuisines,
foodratings
ratings)
foodratings(string[]
foods,
cuisine.
cuisine)
cuisines[i]
ratings,
ratings[i]
product_name,
s(i,
widths.
unit)
crossed
crossed.
obviously
sub-array.
flattening
array.flat
logarithmic
groups).
(bx1,
(ax2,
rectilinear
ay2).
(ax1,
by1)
(bx2,
by2).
ay1)
arr.length,
inclusive),
scramble
scrambled
nums[nums[i]]
zero-based
diagonals.
secondary
0.)
hole
graph[a]
graph[1].
move),
(node
hole,
cat,
rain,
oceans.
island's
cell's
ocean
ocean.
pacific
flow
heights[r][c]
atlantic
supersequence
judgement
diagonal,
switching
dice,
face-up
ways)
kn
(out
max(bik)
sized
nums[i...j].
bij
"0.011.255.245",
dots.
"192.168.1.312"
"0.1.2.201"
ops[i]
ops,
m[x][y]
expect
helps
tobe(val)
equal".
"equal".
"not
developers
nottobe(val)
citybi]
[cityai,
cityai
citybi.
loop,
targets[i].
"eeecd".
sources[i]
targets[i]
sources,
sources
["ab","bc"]
targets,
testcase
occur,
third".
third",
bigram
"first
seq.length
seq[i
mailbox.
mailboxes
houses[i]
subset,
dth
paragraph
case-insensitive
bookcase
shelf.
shelfwidth.
books[i]
bookshelf
thickness
[thicknessi,
books.
shelfwidth,
books
book.
shelf
shelf,
books,
shelves
ans[1]
manner
ans[0]
formatting
license
invocation).
sortracker
score)
ordinal
sortracker()
supports:
better.
scenic
invoked
querying
add(string
attractiveness
worst.
queried
get()
locations,
query).
pencils.
pens
cost1
pencil
utensil.
pencils
cost2
pen
counts.
decrement,
decrement.
inc(string
allone
allone()
strings'
dec(string
getminkey()
getmaxkey()
o`one
base-2
base-k.
1001
2-mirror
base-10
contrary,
k-mirror
root.right.val)
sub-nodes,
sub-nodes.
sub-node.
min(root.left.val,
[4,6,16]
gcds
gold.
gold
"()))",
"())))".
ki]
reconstruction
[hj,
kj]
attributes
queue[j]
(queue[0]
expressive
"heeellooo",
"ll",
"ooo".
"h",
"hiiii"
"heeellooo"
"hellooo",
stretchy
"ll"
"oo"
"hi"
"helloo"
"hellooo"
stretchy.
"helllllooo",
feeling.
"helllllooo".
"lllll"
"helllllooo"
same:
"o"
maintaining
fancy.
ret[i]
[valuei,
items1
items2,
ret
valuei
weighti
mode
occurred
mode(s)
mode,
self-dividing
128
updatesubrectangle(int
subrectangle
subrectanglequeries
newvalue)
newvalue
getvalue(int
(row1,col1)
(row,col)
col2,
(row2,col2).
25]
"aba".
xn-1
relation
xn-2.
wrapper
comma
features:
arraywrapper
string()
operator,
s[x..y],
s[i..j]
operations[i][1]
operations[i][1].
operations[i][0]
10101,
decreasing,
receptor.
receptor
receptors
corners,
ray
eventually.
mirrors
reflection
southwest
tilt.
tilt
endi-1
pairs.length,
<num1>
"<num1>+<num2>"
<num2>
suffixes
"<a/b>",
suffix)
everywhere
swim
swim.
course,
delay,
afterwards.
discovering
forget,
aware
forget
discovers
comparison
turbulent
arr[j]]
arr[k
[arr[i],
3).
ceil(nums[i]
